In [24]:
import pandas as pd

df= pd.read_excel('data/score.xlsx',index_col="지원번호")

In [ ]:
### 데이터 선택 조건 if

TypeError: '>' not supported between instances of 'str' and 'int'

In [ ]:
df[~filt]   # 조건에 맞지 않는것만 출력

NameError: name 'filt' is not defined

In [ ]:
# df.loc[row행, column열]
df.loc[filt,'키']

In [ ]:
data = {
   '영화' : ['명량', '극한직업', '신과함께-죄와 벌', '국제시장', '괴물', '도둑들', '7번방의 선물', '암살'],
   '개봉 연도' : [2014, 2019, 2017, 2014, 2006, 2012, 2013, 2015],
   '관객 수' : [1761, 1626, 1441, 1426, 1301, 1298, 1281, 1270], # (단위 : 만 명)
   '평점' : [8.88, 9.20, 8.73, 9.16, 8.62, 7.64, 8.83, 9.10]
}

df2 = pd.DataFrame(data)

### 평점이 9.0을 넘는 모든 컬럼을 출력하시오
### 9.0 미만인 경우는 영화 이름, 평점만 출력하시오

In [ ]:
f2 = df2['평점']>=9.0   # 9.0이상
df2[~f2][['영화','평점']]   # 9.0 미만

In [14]:
df2.loc[f2,['영화','평점']]

     영화    평점
1  극한직업  9.20
3  국제시장  9.16
7    암살  9.10

In [36]:
# 키 185 이상이면서 ,수학점수 80점 이상 출력하시오
# df[~(df['키']>=185 & df['수학']>=80)]
df[(df['키']>=185) & (df['수학']>=80)]
df[~((df['키']>=185) & (df['수학']>=80))]

       이름    학교    키  국어  영어  수학  과학  사회        SW특기
지원번호
2번    유관순   가산고  184  40  35  50  55  25        Java
3번    이순신   가산고  168  80  75  70  80  75  Javascript
4번    강감찬   가산고  187  40  60  70  75  80         NaN
5번     김구   가산고  188  15  20  10  35  10         NaN
7번    홍길자  디지털고  188  55  65  45  40  35      PYTHON

In [40]:
# 키가 185이하 또는 수학이 70점 이상인 학생을 출력하시오
df[(df['키']<=185) | (df['수학']>=70)]
df[~((df['키']<=185) | (df['수학']>=70))]

       이름    학교    키  국어  영어  수학  과학  사회    SW특기
지원번호
5번     김구   가산고  188  15  20  10  35  10     NaN
7번    홍길자  디지털고  188  55  65  45  40  35  PYTHON